(ns sentence-sel.routes.services
  (:require [ring.util.http-response :refer :all]
            [compojure.api.sweet :refer :all]
            [schema.core :as s]))

(def index (atom 0))
(def db [
              "要对国家法律法规存有敬畏之心"
              "严格遵守国家法律法规规章制度"
              "要对领导长辈存有敬畏之心"
              "慈悲之心要以诚待人与人为善"
              "坚持以人为本、和谐共赢"
              "坚持追求绩效、不断提高"
              "坚持开拓创新、勇于探索"
              "坚持实事求是、诚实守信"
              "坚持认真负责、敢于担当"
              "国政通大家庭的主人翁精神"
              "高效率快节奏的只争朝夕精神"
              "创一流上水平的开拓创新精神"
              "敢于吃苦耐劳的艰苦创业精神"
              "识大体顾大局的无私奉献精神"
              "坚持解决问题、闻过必改"
              "导向性与实用性相结合"
              "定性与定量相结合的工作方法"
              "突出重点与兼顾一般相结合"
              "胜过那丰收五谷新酒的人"
              "你必将生命的道路指示我"
              "慈爱的人，你以慈爱待他"
              "完全的人，你以完全待他"
              "愿你赦免我隐而未现的过错"
              "你仅需轻描淡写的说出他的缺点"
              "愚者自以为聪明，智者则有自知之明"
              "不要向人借钱，也不要借钱给人"
              "世上之事物本无善恶之分,思想使然"
              "恋人们看不到自己做的傻事"
              "得到即是完结,快乐的精髓在于过程"
              "懦夫在未死以前就已经死了好多次"
              "借钱出去，常常既丢了钱，也丢了朋友"
              "所有的男男女女不过是一些演员"
              "一个人的一生中扮演着好几个角色"
              "离别是这样甜蜜的凄清"
              "我真要向你道晚安直到天明!"
              "让我们宣誓表示我们的决心"
              "再让我一个一个握你们的手"
              "他不知道谁和谁为什么打起架来了"
              "幸而已经春天，棉被可以无用"
              "渐渐觉得世上有些古怪"
              "他忽而听得一种异样的声音"
              "他似乎从来没有经验过这样的无聊"
              "从此决不能望有白盔白甲的人来叫他"
              "他曾在山脚下遇见一只饿狼"
              "使人人见了便知你是件奇物"
              "那娲皇只用了三万六千五百块"
              "人生天地之间，若白驹过隙，忽然而已"
              "来世不可待，往世不可追也"
              "君子之交淡若水，小人之交甘若醴"
              "朴素而天下莫能与之争美。"
              "吾生也有涯，而知也无涯"
              "巧者劳而智者忧，无能者无所求。"
              "子非我，安知我不知鱼之乐"
              "不可行恶人的路。不要走坏人的道"
              "口吐真言，永远坚立。舌说谎话，只存片时。"
              "今夜我们可共宴, 欢迎你们归国"
              "看他埋头苦读的那付可怜样"
              "我们需上法庭来判断此论吗"
              "欲穷千里目，更上一层楼"
              "只要工夫深，铁杵磨成针"
              "任凭风浪起，稳坐钓鱼船"
              "蜀中无大将，廖化作先锋"
              "千里送鹅毛，礼轻情意重"
              "哑巴吃黄连，有苦说不出"
              "宁与千人好，莫与一人敌"
              "留得青山在，不怕没柴烧"
              "海内存知己，天涯若比邻"
              "瓜田不纳履，李下不正冠"
              "威武不能屈，贫贱不能移"
              "好事不出门，恶事传千里"
              "路遥知马力，日久见人心"
              "朱门酒肉臭，路有冻死骨"
              "一粥一饭，当思来处不易"
              "野火烧不尽，春风吹又生"
              "淡泊以明志，宁静以致远"
              "以其人之道，还治其人之身"
              "言之者无罪，闻之者足以戒"
              "鸡犬之声相闻，老死不相往来"
              "天有不测风云，人有旦夕祸福"
              "运筹帷幄之中，决胜千里之外"
              "少壮不努力，老大徒伤悲"
              "天下本无事，庸人自扰之"
              "福兮祸所伏，祸兮福所倚"
              "前不见古人，后不见来者"
              "只要功夫深，铁杵磨成针"
              "鹬蚌相争，坐收渔翁之利"
              "踏破铁鞋无觅处，得来全不费工夫"
              "先天下之忧而忧，后天下之乐而乐"
              "沉舟侧畔千帆过，病树前头万木春"
              "平生不作亏心事，夜半敲门不吃惊"
              "如入芝兰之室，久而不闻其香"
              "与君一夕话，胜读十年书"
              "只听楼梯响，不见人下来"
              "故人西辞黄鹤楼，烟花三月下扬州"
              "孤帆远影碧空尽，惟见长江天际流"
              "开始的时侯，我们就知道，总会有终结"
              "它的整体样子像一只大章鱼"
              "浇水可不是想像中的那么简单"
              "松树一年四季都那样挺拔"
              "在我眼里你不会变老，不会褪色，不会死去"              
              ])

(defn jufra []
  (let [idx (rand-int 100)] 
    (str (inc  idx) ":"  (get db idx)))
  )


(defapi service-routes
  {:swagger {:ui "/apiui"
             :spec "/swagger.json"
             :data {:info {:version "1.0.0"
                           :title "Sample API"
                           :description "Sample Services"}}}}
  
  (context "/api" []
    :tags ["thingie"]
    
    (GET "/jufra" []
      :return      String 
      :summary      "selet one sentence for 100 "
      (ok (jufra)))
    
    ))
